import Card from "antd/es/card"
// import { EMAIL_SUPPORT, PAYBOX_URL } from "../../App"
import "../../styles/about-page.css"
import PageFooter from "../Common/PageFooter"
// import { Icon } from "../Common/Icon"

export function PrivacyPolicyPage() {
    return (
        <section className="about-page page">
            <Card className="about-page-card">
                <h1 className="about-page-title">מדיניות הפרטיות</h1>

                <label className="section-title">1. מידע כללי</label>
                <article className="text-box">
                    <ul>
                        <li>
                            העמותה לקונטקט אימפרוביזציה בישראל (ע"ר) , שממוקמת
                            בתל-אביב, ישראל, מתחזקת את השירותים האינטרנטיים הללו
                            בהתאם לחוקי הפרטיות הישראלים.
                        </li>
                        <li>
                            יש לך זכות לבקש מידע על נתונים אישיים שנשמרו, לתקן,
                            למחוק, או להגביל את השימוש בהם.
                        </li>
                    </ul>
                </article>
                <br />
                <label className="section-title">2. אתר אינטרנט</label>
                <article className="text-box">
                    <ul>
                        <li>
                            נתונים נאספים לצורך הצגת תוכן, פרסום אירועים ויצירת
                            פרופילים.
                        </li>
                        <li>
                            שימוש בשירותי צד שלישי, כמו Google Maps, כפוף
                            למדיניות הפרטיות של הספקים.
                        </li>
                        <li>נתוני האירועים נשמרים עד תום האירוע ואז נמחקים.</li>
                    </ul>
                    <br />
                    2.1 העברת תכנים מקוונים <br />
                    <br />
                    2.1.1 מטרה וסוג הנתונים המעורבים
                    <br />
                    כדי לאפשר לך לצפות בתכנים מאתרי האינטרנט שלנו, הדפדפן שלך
                    ישדר את המידע הבא (כחלק מבקשת HTTP): כתובת ה-IP שלך (תווית
                    מספרית שמזהה את הגישה שלך לאינטרנט), התכנים שביקשת מהאתר,
                    מידע על סוג הדפדפן והמערכת ההפעלה בשימוש.
                    <br />
                    <br />
                    2.1.2 בסיס משפטי
                    <br />
                    הנתונים המוזכרים לעיל נדרשים לצורך העברת התכנים כפי שביקשת
                    ולשיפור הדרך שבה הם מוצגים. הנתונים הללו מעובדים על בסיס
                    אינטרס לגיטימי שלנו להעביר תכנים כפי שהמשתמשים ביקשו.
                    <br />
                    <br />
                    2.1.3 העברת נתונים וגישה לנתונים
                    <br />
                    הזכות לגשת לנתונים מבוססת על הכללים הפנימיים שלנו לגבי
                    הרשאות גישה, וכן על ההסכמים הכתובים הרלוונטיים עם ספקי
                    השירות שלנו.
                    <br />
                    <br />
                    2.1.4 שמירת נתונים
                    <br />
                    אנו שומרים את הנתונים הללו רק עד שהתכנים המבוקשים יועברו
                    למשתמש.
                    <br />
                    <br />
                    2.1.5 זכויותיך
                    <br />
                    באופן כללי, אין זכות חוקית לכך שהנתונים המועברים בתהליך
                    הגישה לתכנים מקוונים יתוקנו, יימחקו או יימסרו למשתמש, שכן
                    הנתונים נשמרים באופן זמני בלבד לצורך העברת התכנים המבוקשים
                    ומיד נמחקים בסיום הפעולה. לפיכך, הנתונים הללו לא יהיו זמינים
                    יותר לבקשות פרטיות.
                    <br />
                    עם זאת, באפשרותך להגיש בקשה בנוגע למידע כזה, ואנו ננסה לשקול
                    ולכבד בקשות כאלו ככל שניתן, גם אם אין חובה חוקית לעשות זאת.
                    אם לא נוכל או לא נהיה מעוניינים לעשות זאת, נספק לך את
                    נימוקינו בכתב.
                    <br />
                    <br />
                    2.2 העברת תכנים מצד שלישי
                    <br />
                    האתרים שלנו משתמשים בשירותי צד שלישי כדי לשלב תכנים מצד
                    שלישי. המשתמשים מנותבים מחדש כיוון שיש לנו אינטרס לגיטימי
                    להעשיר את התכנים שאנו מספקים בתכנים של אחרים ובכך לקשר בין
                    התכנים. כדי לעשות זאת, תנותב לשירותים המתאימים, ובעזרת בקשות
                    HTTP, השירותים המדוברים יוכלו לדעת שביקרת באתר שלנו.
                    <br />
                    <br />
                    לאחר שתתחיל להשתמש בשירותי צד שלישי, יחולו מדיניות הפרטיות
                    שלהם.
                    <br />
                    <br /> אתר זה משתמש ב-Google Maps להצגת מפות ויצירת מסלולי
                    נסיעה. Google Maps מופעל על ידי Google Inc., 1600
                    Amphitheatre Parkway, Mountain View, CA 94043, ארצות הברית.
                    בשימוש באתר זה, אתה מסכים לאיסוף, עיבוד ושימוש בנתונים
                    שנאספים אוטומטית והנתונים שהוזנו על ידך (כולל כתובת ה-IP
                    שלך) על ידי Google, אחד מנציגיה או ספקי צד שלישי. תנאי
                    השימוש של Google Maps ניתן למצוא בלינק הבא:
                    https://www.google.de/intl/de/policies/privacy. Google גם
                    מעבדת את המידע שלך בארה"ב במסגרת Privacy Shield של האיחוד
                    האירופי וארה"ב:
                    https://www.privacyshield.gov/EU-US-Framework. <br />
                    <br /> 2.3 פרסום אירועים בלוח השנה שלנו <br /> <br /> 2.3.1
                    מטרות וסוגי נתונים <br />
                    מטרת האתר שלנו היא לספק לוח שנה ציבורי לאירועי קונטקט
                    אימפרוביזציה. לכן, נשמור את נתוני האירועים שנכנסים לאתר שלנו
                    כדי לספק את השירות. נתונים אלו כוללים: <br />
                    <ul>
                        <li>מיקום האירוע (חובה, מוצג באתר)</li>
                        <li>קישור לפייסבוק (לא חובה, מוצג באתר)</li>
                        <li>כתובת URL של דף האירוע (מוצג באתר)</li>
                        <li>שמות המארגנים (לא חובה, מוצג באתר),</li>
                        <li>
                            קישור לפרופיל ציבורי של המארגן (לא חובה, מוצג באתר)
                        </li>
                    </ul>
                    <br />
                    2.3.2 בסיס משפטי
                    <br />
                    הנתונים נשמרים ומתפרסמים בהסכמתך.
                    <br />
                    <br />
                    2.3.3 העברת נתונים וגישה לנתונים
                    <br />
                    הזכות לגשת לנתונים מבוססת על הכללים הפנימיים שלנו לגבי
                    הרשאות גישה, וכן על ההסכמים הכתובים הרלוונטיים עם ספקי
                    השירות שלנו.
                    <br />
                    <br />
                    2.3.4 שמירת נתונים
                    <br />
                    נתוני האירועים נשמרים עד שהאירוע מסתיים. לאחר מכן, כל נתוני
                    האירוע נמחקים מהלוח ומהמאגר.
                    <br />
                    <br />
                    2.3.5 זכויותיך
                    <br />
                    יש לך את הזכות לבקש למחוק, לתקן, ולהגביל את אופן עיבוד
                    הנתונים.
                    <br />
                    <br />
                    2.4 יצירת ופרסום פרופילים
                    <br />
                    <br />
                    2.4.1 מטרות וסוגי נתונים
                    <br />
                    <br />
                    <b>רישום משתמשים</b>
                    <br />
                    <br />
                    משתמשים יכולים ליצור פרופילים כדי לפרסם אירועים. אף אחד
                    משדות רישום המשתמשים אינו מוצג באתר. אימייל רישום שם מדינה
                    תפקיד בקהילת הקונטקט
                    <br />
                    <br />
                    <b>פרופיל מורה</b>
                    <br />
                    מורים יכולים לבחור להפוך את הפרופילים שלהם לציבוריים כדי
                    להציג את עצמם למבקרי האתר. כאשר זה קורה, נשמור את הנתונים
                    להציג את עצמם למבקרי האתר. כאשר זה קורה, נשמור את הנתונים
                    שנכנסו כדי לפרסם את הפרופיל. זה כולל: שם (חובה, מוצג באתר),
                    מדינה (חובה, מוצג באתר), מספר השנים המעורב בקונטקט (לא חובה,
                    מוצג באתר), קישור לפרופיל פייסבוק (לא חובה, מוצג באתר),
                    תמונת פרופיל (לא חובה, מוצג באתר).
                    <br />
                    <br />
                    <b>פרופיל מארגן</b>
                    <br />
                    מארגנים יכולים לבחור להפוך את הפרופילים שלהם לציבוריים כדי
                    להציג את עצמם למבקרי האתר. כאשר זה קורה, נשמור את הנתונים
                    שנכנסו כדי לפרסם את הפרופיל. זה כולל: אימייל (חובה, לא מוצג
                    באתר), שם (חובה, מוצג באתר), טלפון (לא חובה, מוצג באתר),
                    קישור לאתר אינטרנט (לא חובה, מוצג באתר).
                    <br />
                    <br />
                    2.4.2 בסיס משפטי
                    <br />
                    הנתונים נשמרים ומתפרסמים בהסכמתך.
                    <br />
                    <br />
                    2.4.3 העברת נתונים וגישה לנתונים
                    <br />
                    הזכות לגשת לנתונים מבוססת על הכללים הפנימיים שלנו לגבי
                    הרשאות גישה, וכן על ההסכמים הכתובים הרלוונטיים עם ספקי
                    השירות שלנו.
                    <br />
                    <br />
                    2.4.4 שמירת נתונים
                    <br />
                    הנתונים האישיים המדוברים יישמרו, אלא אם כן האדם המדובר ימשוך
                    את הסכמתו לשימוש בנתונים ויבקש למחוק אותם.
                    <br />
                    <br />
                    2.4.5 זכויותיך
                    <br />
                    ביחס לסוג נתונים זה, יש זכות כללית לבקש מידע ותיקון.
                </article>
            </Card>
            <PageFooter />
        </section>
    )
}
