import Card from "antd/es/card"
import "../../styles/about-page.css"
import PageFooter from "../Common/PageFooter"

export function TCPage() {
    return (
        <section className="about-page page">
            <Card className="about-page-card">
                <h1 className="about-page-title">תנאי השירות והגבלות</h1>

                <label className="section-title">הקדמה</label>
                <article className="text-box">
                    מסמך זה מתאר את הזכויות והכללים שיש לפעול על פיהם בלוח
                    האירועים של הקונטקט. מטרת הפרויקט הוא הנגשה של כל אירועי
                    הקונטקט-אימפרוביזציה בישראל לקהילה הפועמת בו ולהגן על מאגר
                    הנתונים משימוש לרעה וספאם. השירות מוצע ללא עלות לקהילת
                    הקונטקט-אימפרוביזציה הישראלית, אך נדרשת עבודה מקצועית מתמשכת
                    כדי ליישמו, לעדכנו ולתחזקו. בדף הבית ניתן למצוא כפתור תרומה
                    לתמיכה בלוח השנה.
                </article>
                <br />
                <label className="section-title">הנחיות לתוכן</label>
                <article className="text-box">
                    <ul>
                        <li>
                            כל הנתונים המוזנים במאגר חייבים להיות קשורים ברובם
                            לתרגול קונטקט-אימפרוביזציה.
                        </li>
                        <li>
                            אירועים אשר יש בהם אלמנט נוסף שלא עולה על 50% מהתוכן
                            (קונטקט וריליס, קונטקט ופלדנקרייז וכדומה) מתקבלים
                            בברכה.
                        </li>
                        <li>
                            אין להעלות אירועים של תרגול גופני שנעזרים בקונטקט
                            כאחד מכלים שונים (סדנאות תאטרון-קונטקט-ריברסינג-קקאו
                            וכדומה)
                        </li>
                        <li>
                            אין להעלות אירועים של תרגול גופני אחר לבדו גם כן.
                        </li>
                        <li>
                            אין להעלות אירועים קטנים שמיועדים מראש למספר קטן של
                            משתתפים
                        </li>
                        <li>
                            נא לא להעלות אירועים ספונטניים או אירועים ברמת השקעה
                            נמוכה.
                        </li>
                    </ul>
                </article>
                <br />
                <label className="section-title">נגישות</label>
                <article className="text-box">
                    כל אדם יכול להוסיף אירועים ללוח השנה הגלובלי של CI ללא עלות.
                    לשם כך, יש ליצור חשבון אישי ולספק פרטים אישיים כדי לקבל
                    הרשאה. פרטים אלו נדרשים כדי למנוע ספאם. למרות שיש צורך
                    בהרשמה כדי לפרסם אירוע, לוח השנה נגיש לצפייה וחיפוש לכולם.
                </article>
                <br />
                <label className="section-title">איכות הנתונים</label>
                <article className="text-box">
                    רק נתונים התואמים את ההנחיות לתוכן של לוח האירועים יורשו
                    להיטען. משתמשים מעלים נתונים מלאים של התוכן (תאריך, מיקום,
                    שעה וכדומה). שימוש לרעה בפונקציית ההעלאה (תוכן זר, קטגוריה
                    שגויה) עלול להוביל למחיקת התוכן על ידי מנהל לוח השנה, ולאחר
                    כמה אזהרות או עבירה חמורה, תחסם האפשרות להעלאת תוכן נוסף
                    מהמשתמש הקיים או תוכן של מארגן האירוע ממשתמשים אחרים. במקרה
                    של סכסוכים, ישנה ועדה המפקחת על טיפול בסכסוך.
                </article>
                <br />
                <label className="section-title">בעלות על הנתונים</label>
                <article className="text-box">
                    משתמש המפרסם אירוע, הוא בעל הבעלות והאחריות על המידע שסופק.
                    רק האדם שפרסם את האירוע והמנהל יכולים לערוך, לשנות או למחוק
                    את האירוע. אם אתה גוף או מארגן שמפרסם אירוע של קולגה או חבר,
                    עשה זאת רק בהסכמת המארגן והמורה.
                </article>
                <br />
                <label className="section-title">ניהול איכות הנתונים</label>
                <article className="text-box">
                    אם יועלה תוכן שאינו תואם את ההנחיות, או תוכן זר (ספאם),
                    המנהל רשאי למחוק את התוכן. בנוסף, משתמשים יכולים לדווח למנהל
                    על תוכן בעייתי באמצעות כפתור "דווח על שימוש לרעה" הנמצא בכל
                    פוסט. המשתמש יכול לציין אחת מהסיבות הבאות: לא קשור לקונטקט
                    אימפרוביזציה, מכיל מידע שגוי או אחר (יש לפרט בהודעה). במקרה
                    של סכסוך בנוגע לשימוש לרעה, הועדה המפקחת יכולה להתערב, לתאם
                    את התקשורת בין הצדדים המעורבים ולשמש כ"בורר".
                </article>
                <br />
                <label className="section-title">אופן השימוש</label>
                <article className="text-box">
                    <u>כמשתמש המחפש מידע</u>
                    <br />
                    לוח האירועים פתוח ונגיש ברשת (עיון בלוח לא מצריך הזדהות).
                    ניתן לחפש אירועים לפי מספר קריטריונים (כגון תאריך ומיקום).
                    <br />
                    <u>מאפייני החיפוש הניתנים לשינוי:</u>
                    <br />
                    <ul>
                        <li>
                            מה: סוגי אירועים: סדנאות, שיעורים, פסטיבלים, ג'מים
                            קבועים, ג'מים בסופי שבוע, כנסים, מעבדות או סוגים
                            אחרים של אירועי קונטקט-אימפרוביזציה.
                        </li>
                        <li>היכן: עיר ושם המקום.</li>
                        <li>
                            מתי: תאריך ושעה של האירוע. ניתן לבחור תאריך מסוים או
                            תקופה מסוימת.מי: חיפוש מורים ספציפיים.
                        </li>
                    </ul>
                    אירועים ישנים (אירועים שכבר התקיימו) נמחקים ממאגר הנתונים
                    ואי אפשר לחפש אותם יותר.
                    <br />
                    <u>הרשמה לעדכונים שבועיים</u>
                    <br />
                    כל מבקרת באתר תוכל ליצור חשבון על מנת להרשם לעדכונים
                    שבועיים.
                    <ul>
                        <li>
                            יצירת חשבון (וכניסה חוזרת) ע״י הזנת מייל וסיסמה או
                            חיבור לחשבון גוגל.
                        </li>
                        <li>
                            יש צורך בשמירת האתר כweb-app בעמוד הבית של המכשיר
                            הסלולרי ע״מ להרשם לעדכון שבועי
                        </li>
                        <li>
                            בזמן ההרשמה לעדכון ניתן לבחור אילו אירועים כלולים
                            בעדכון האישי שלי לפני הסינון שהמשתמשת מגדירה (למשל:
                            ג׳אמים שבועיים במרכז)
                        </li>
                        <li>
                            ישנה אפשרות לשנות את הגדרות הסינון של העדכון האישי
                            וכן לבטל את העדכון בכל רגע.
                        </li>
                        <li>
                            העדכון ישלח כהתראה מהweb-app פעם בשבוע במוצאי שבת
                        </li>
                    </ul>
                </article>
            </Card>
            <PageFooter />
        </section>
    )
}
